testdata/card-rejected.json

{"id":95403463567,"date_created":"2024-12-08T22:34:16.127-04:00","date_approved":null,"date_last_updated":"2024-12-08T22:34:16.127-04:00","date_of_expiration":null,"money_release_date":null,"money_release_status":"released","operation_type":"regular_payment","issuer_id":"18","payment_method_id":"amex","payment_type_id":"credit_card","payment_method":{"id":"amex","type":"credit_card","issuer_id":"18","data":{"routing_data":{"merchant_account_id":"7187481"}}},"status":"rejected","status_detail":"cc_rejected_high_risk","currency_id":"BRL","description":null,"live_mode":true,"sponsor_id":null,"authorization_code":null,"money_release_schema":null,"taxes_amount":0,"counter_currency":null,"brand_id":null,"shipping_amount":0,"build_version":"3.81.0-rc-1","pos_id":null,"store_id":null,"integrator_id":null,"platform_id":null,"corporation_id":null,"charges_execution_info":{"internal_execution":{"date":"2024-12-08T22:34:16.103-04:00","execution_id":"01JEMM8X3KEZRVMYSA3K3CDGTZ"}},"payer":{"type":null,"id":"1670300231","operator_id":null,"email":null,"identification":{"number":null,"type":null},"phone":{"number":null,"extension":null,"area_code":null},"first_name":null,"last_name":null,"entity_type":null},"collector_id":1684042542,"marketplace_owner":null,"metadata":{},"additional_info":{},"order":{},"external_reference":null,"transaction_amount":1,"transaction_amount_refunded":0,"coupon_amount":0,"differential_pricing_id":null,"financing_group":null,"deduction_schema":null,"installments":1,"transaction_details":{"payment_method_reference_id":null,"acquirer_reference":null,"net_received_amount":0,"total_paid_amount":1,"overpaid_amount":0,"external_resource_url":null,"installment_amount":1,"financial_institution":null,"payable_deferral_period":null},"fee_details":[],"charges_details":[{"id":"95403463567-001","name":"mercadopago_fee","type":"fee","accounts":{"from":"collector","to":"mp"},"client_id":0,"date_created":"2024-12-08T22:34:16.129-04:00","last_updated":"2024-12-08T22:34:16.129-04:00","amounts":{"original":0.05,"refunded":0},"metadata":{"source":"rule-engine"},"reserve_id":null,"refund_charges":[]}],"captured":true,"binary_mode":false,"call_for_authorize_id":null,"statement_descriptor":null,"card":{"id":null,"first_six_digits":null,"last_four_digits":"5765","bin":null,"expiration_month":null,"expiration_year":null,"date_created":null,"date_last_updated":null,"country":null,"tags":[],"cardholder":{"identification":{"number":null,"type":null},"name":null}},"notification_url":null,"refunds":[],"processing_mode":"aggregator","merchant_account_id":null,"merchant_number":null,"acquirer_reconciliation":[],"point_of_interaction":{"type":"UNSPECIFIED","business_info":{"unit":"online_payments","sub_unit":"default","branch":"Merchant Services"},"transaction_data":{}},"accounts_info":null,"release_info":null,"three_ds_info":{"external_resource_url":null,"creq":null},"tags":null}